### 판다스 쪽지시험

In [1]:
import pandas as pd

In [2]:
# 1번
data = {'이름':['메로나', '비비빅', '죠스바'],
        '가격':[300, 400, 250],
        '재고':[20, 3, 100]}

df = pd.DataFrame(data)
df

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [3]:
df

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [4]:
print(df.index, df.columns, df.dtypes, df.shape, df.ndim, df.size ,sep='\n')    # size가 아닌 values

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '가격', '재고'], dtype='object')
이름    object
가격     int64
재고     int64
dtype: object
(3, 3)
2
9

In [5]:
df[['이름', '재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [6]:
df.loc[1, ['가격', '재고']]

가격    400
재고      3
Name: 1, dtype: object

In [7]:
df.loc[[0, 2], ['가격', '재고']]

    가격   재고
0  300   20
2  250  100

In [8]:
df.rename({0:'일', 1:'이', 2:'삼'}, inplace=True)
df

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [9]:
df['총가격'] = 0
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [10]:
df.loc['사'] = ['빵빠레', 550, 10, 0]
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [11]:
df.loc['이', '재고'] = 23

In [12]:
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [13]:
# 2번
data = [
    [2000, 3050, 2050, 1980],
    [7500, 2050, 2050, 1980],
    [15450, 15050, 15550, 14900]
]

In [14]:
df2 = pd.DataFrame(data, columns=['시가', '고가', '저가', '종가'])
df2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [15]:
print(df2.index, df2.columns, df2.dtypes, df2.size, df2.ndim, df2.shape, sep='\n')

RangeIndex(start=0, stop=3, step=1)
Index(['시가', '고가', '저가', '종가'], dtype='object')
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
12
2
(3, 4)

In [16]:
df2.rename({0:'2024-01-01', 1:'2024-02-01', 2:'2024-03-01'}, inplace=True)

In [17]:
df2.rename({'시가':'Open','고가':'High','저가':'Low','종가':'Close'}, axis=1, inplace=True)

In [18]:
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [19]:
df2.loc['2024-02-01', ['High', 'Close']]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [20]:
df2.loc['2024-04-01'] = [3200, 3550, 3000, 2990]

In [21]:
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [22]:
df2.drop(index='2024-01-01', inplace=True)
df2

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [23]:
df2.loc['2024-03-01', 'Low'] = 14000
df2

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [24]:
df2['Averge'] = 0
df2

             Open   High    Low  Close  Averge
2024-02-01   7500   2050   2050   1980       0
2024-03-01  15450  15050  14000  14900       0
2024-04-01   3200   3550   3000   2990       0

In [25]:
df2['Total'] = 0
df2

             Open   High    Low  Close  Averge  Total
2024-02-01   7500   2050   2050   1980       0      0
2024-03-01  15450  15050  14000  14900       0      0
2024-04-01   3200   3550   3000   2990       0      0

3번
- 데이터
- 데이터프레임
- 시리즈(Series)
- 데이터프레임(DataFrame)
- 시리즈 X --- array를 사용함. 
- 시리즈
- 시리즈
- 데이터프레임